src/Documents/ЗаказНаряд/ЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаряд</name>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостоянияЗаказовНарядов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыЗаказчиком</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемыМастером</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/HTTPServices/customerOrders/Module.bsl
// HTTP-сервис "customerOrders"
// Обработчик POST-запроса для создания нового заказ-наряда.
// Принимает JSON с данными заказа, создаёт документ "ЗаказНаряд" и проводит его.

// Параметры тела запроса (JSON):
//   Сотрудник    – строка, наименование сотрудника из справочника "Сотрудники"
//   Клиент       – строка, наименование клиента из справочника "Контрагенты"
//   ДатаЗаписи   – строка в формате ISO (например, "2025-06-18T14:30:00Z"),
//                  преобразуется в дату для реквизита "ДатаЗаписи"
//   МассивУслуг  – массив объектов, каждый содержит:
//       Номенклатура – строка, наименование услуги из справочника "Номенклатура"
//       Количество   – число
//       Цена         – число
//       Сумма        – число
// Возвращает HTTP-ответ:
//   200 – документ создан и проведён, в теле сообщение с его номером
//   400 – ошибка в переданных данных (не найдены сотрудник/клиент, пустая табличная часть и т.п.)
//   500 – внутренняя ошибка сервера при создании или проведении
#Область ОбработчикиСобытий
Функция customerOrdersPOST(Запрос)
    
    // --- Чтение тела запроса и десериализация JSON ---
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку()); 
    ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
    ЧтениеJSON.Закрыть();
    
    // --- Создание нового документа "ЗаказНаряд" ---
    НоваяЗапись            = Документы.ЗаказНаряд.СоздатьДокумент(); 
    
    // Поиск сотрудника по наименованию. Если не найден – возвращаем 400.
    НоваяЗапись.Сотрудник  = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса.Сотрудник);
    Если Не ЗначениеЗаполнено(НоваяЗапись.Сотрудник) Тогда
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Сотрудник с наименованием '" + ДанныеЗапроса.Сотрудник + "' не найден");
        Возврат Ответ;
    КонецЕсли;
    
    // Поиск клиента по наименованию. Если не найден – возвращаем 400.
    НоваяЗапись.Клиент     = Справочники.Контрагенты.НайтиПоНаименованию(ДанныеЗапроса.Клиент);
    Если Не ЗначениеЗаполнено(НоваяЗапись.Клиент) Тогда
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Клиент с наименованием '" + ДанныеЗапроса.Клиент + "' не найден");
        Возврат Ответ;
    КонецЕсли;
    
    // Дата документа – текущая дата сервера.
    НоваяЗапись.Дата       = ТекущаяДатаСеанса();
    // Преобразование строки ISO в дату 1С.
    НоваяЗапись.ДатаЗаписи = ПрочитатьДатуJSON(ДанныеЗапроса.ДатаЗаписи, ФорматДатыJSON.ISO);
    
    // --- Заполнение табличной части "Услуги" ---
    Для Каждого СтруктураУслуги Из ДанныеЗапроса.МассивУслуг Цикл 
        НоваяУслуга            = НоваяЗапись.Услуги.Добавить();
        НоваяУслуга.Услуга     = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги.Номенклатура);
        НоваяУслуга.Количество = Число(СтруктураУслуги.Количество);
        НоваяУслуга.Цена       = Число(СтруктураУслуги.Цена);      
        НоваяУслуга.Сумма      = Число(СтруктураУслуги.Сумма);
    КонецЦикла;
    
    // Проверка, что в документе есть хотя бы одна услуга.
    Если НоваяЗапись.Услуги.Количество() = 0 Тогда
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Табличная часть 'Услуги' не может быть пустой");
        Возврат Ответ;
    КонецЕсли;
    
    // --- Запись документа с проведением ---
    Попытка
        НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение); 
        ТекстОтвета = "Создан и проведен документ " + НоваяЗапись.Номер;
        Ответ = Новый HTTPСервисОтвет(200);
    Исключение
        Ответ = Новый HTTPСервисОтвет(500);
        ТекстОтвета = "Произошла ошибка: " + ОписаниеОшибки();
    КонецПопытки;
    
    Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
    
    Возврат Ответ; 
    
КонецФункции
#КонецОбласти
